from string import Template

### RAG Prompts (Arabic) ###

## System prompt ##
system_prompt = Template("\n".join([
    "أنت مساعد مكلف بإنشاء إجابات لاستفسارات المستخدمين باستخدام مجموعة من المستندات المقدمة.",
    "اقرأ استفسار المستخدم والمستندات المرتبطة به بعناية. استخدم فقط المعلومات من المستندات المقدمة ذات الصلة المباشرة بالاستفسار.",
    "تجاهل المستندات غير المتعلقة بسؤال المستخدم. إذا حددت بعد المراجعة أنك لا تستطيع الإجابة على الاستفسار بناءً على المستندات ذات الصلة، فاعتذر للمستخدم بأدب.",
    "في جميع الحالات، قم بصياغة إجابتك بنفس لغة استفسار المستخدم.",
    "كن مهذباً ومحترماً في أسلوبك، وتأكد من أن إجابتك دقيقة وموجزة، مع تجنب المعلومات غير الضرورية.",
    ]))

## Document ##
document_prompt = Template("\n".join([
    "## رقم المستند: $doc_num",
    "### المحتوى: $chunk_text",
]))

## Footer ##
footer_prompt = Template("\n".join([
    "بناءً على المستندات أعلاه فقط، يرجى إنشاء إجابة لإستفسار/سؤال المستخدم .",
    "## إستفسار/سؤال المستخدم: $user_query",
    "## الإجابة:",
]))